# Задача 1.
# Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.

# day = int(input("Введите день недели число: "))
# if day > 7:
#     print("Этого дня недели не существует")
# elif day > 5:
#     print("Да")
# else:
#     print("Нет")


# Задача 2.
# Напишите программу, которая принимает на вход координаты точки (X и Y), 
# и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
  
    # - x=34; y=-30 -> 4
    # - x=2; y=4-> 1
    # - x=-34; y=-30 -> 3

# x = int(input("Введите координату на оси x: "))
# y = int(input("Введите координату на оси y: "))
# if x >= 0:
#     if y >= 0:
#         print("1 четверть")
#     else:
#         print("4 четверть")
# else:
#     if y >= 0:
#         print("2 четверть")
#     else:
#         print("3 четверть")


# Задача 3. 
# Напишите программу, которая по заданному номеру четверти, 
# показывает диапазон возможных координат точек в этой четверти (x и y).

# n = int(input("Введите номер четверти на осях координат: "))
# if n == 1:
#     print("x >= 0, y >= 0")
# elif n == 2:
#     print("x < 0, y > 0")
# elif n == 3:
#     print("x < 0, y < 0")
# elif n == 4:
#     print("x > 0, y < 0")
# else:
#     print("Такой четверти не существует")

# Задача 4. 
# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.
   
    # - A (3,6); B (2,1) -> 5,09
    # - A (7,-5); B (1,-1) -> 7,21

import math

x1 = float(input("Введите координату x1: "))
x2 = float(input("Введите координату x2: "))
y1 = float(input("Введите координату y1: "))
y2 = float(input("Введите координату y2: "))

def distance(x1, x2, y1, y2):
    return math.sqrt((x2-x1)**2 + (y2-y1)**2)
c = distance(x1, x2, y1, y2)
print(c)